tutorials/coupled/conjugateHeatSimpleFoam/conjugateCavity/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel            kEpsilon;

turbulence          on;

printCoeffs         on;

laminarCoeffs
{
}

kEpsilonCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphaEps         0.76923;
}

wallFunctionCoeffs
{
    kappa            0.4187;
    E                9;
}

// ************************************************************************* //
